안녕하세요, 야놀자 임경영입니다.
야놀자와 함께하게되는 상황에서 다양한 업무로 바쁘실 것으로 생각됩니다.
보다 상세한 인터파크의 현황파악을 위하여 고명호 팀장님과 1:1 면담을 진행하고자 합니다.
30분정도 소요될 것으로 예상되며, 금일 오후 6시 이후 혹은 내일 오전 11시이후에 간단히 대화 나눠보시면 좋겠습니다.
진행은 화상 미팅으로 진행될 예정입니다.
가능하신 시간 회신 주시면 감사드리겠습니다.(일정 초대 드리도록 하겠습니다.)
감사합니다.
임경영 드림.
---------------------------------------------------------------------------------------
지난 주 목요일 오후 6시 30분경에 야놀자 임경영이라는 분과 화상 미팅 내용 공유 드립니다.
윗분들(실장 이상급) 우선으로 쭉 돌아가면서 하는 미팅을 마치고
팀장들 돌아가면서 어떤 일을 하고 있는지를 확인하는 미팅으로 생각이 들더군요
질문 위주로 생각나는대로 적어 볼게요,
[임경영님 Q]
Q. 팀원은 총 몇 명인가?
Q. 팀원 중 java 개발 가능 인원은 몇 명인가요?
Q. 팀에서 담당하는 업무는 무엇인가요?
Q. 투어플랫폼개발팀에 항공이 포함된거 아닌가요?
Q. 최호준 실장님하고 케미는 어떤가요?
Q. 뉴플랫폼 전환에 걸린 기간은 어떻게 되나요?
Q. AWS 를 쓰지 않고 있는 이유는 무었인가요?
Q. 왜 오라클 DB 쓰고 있나요? 전 참고로 MySQL 를 선호합니다.
Q. 오라클 DB에서 MySQL 로 전환하는 것은 어떻게 생각하나요? 잘 될까요?
Q. 인터파크 티켓 쪽 상품을 투어 액티비티 쪽으로 옮겨오는데 시간은 얼마나 걸릴까요?
Q. 배포는 어떻게 진행하고 주체가 어디인가요?
Q. 개발팀에서 배포까지 담당하지 않는 이유는 무엇인가요?
Q. 연동 업체별로 연동 대응을 하기 위한 배포는 어떤 방식으로 진행을 하나요?
Q. 저한테 궁금하신게 있나요?
[고명호 Q]
Q. 님은 도대체 누구신가요?
Q. 님은 결정권자이신가요? 결정된 사항을 추진만 하는 사람인가요?
Q. 개발 조직 구성은 어떻게 바뀌나요?
Q. 인터파크 인수는 생각을 갖고 한 것인가요, 일단 인수하고 본건가요?
Q. Kickoff 도 하고 이렇게 화상 미팅도 하는데 술 한잔 해야하는거 아닌가요?
1:50
임경영님 질문으로 보면 뭔가 뇌리에 스치는 것들이 있으실걸로 예상됩니다.
1:50
판단은 각자가 ㅎㅎ;